[
    {
      "company": "BISAG-N 🛰️",
      "role": "Software Developer Intern",
      "period": "Jan 2023 - Apr 2023",
      "details": [
        "Built 'Road Surface Quality Investigation' to detect road damage using MERN, Django, ArcGIS, GCP, Cloudinary, CV2.",
        "Trained deep learning models (FasterRCNN, SSD, RetinaNet) with labeled dataset, boosting accuracy by 15%.",
        "Optimized satellite image retrieval using Python multithreading, cutting time from 2 minutes to 50 seconds.",
        "Applied grayscale, linear transformation, Otsu’s thresholding, Hough Transform to clean data and extract road segments.",
        "Designed UML diagrams to model system architecture, ensuring clarity in component interaction and project scalability."
      ],
      "certificateLink": "https://drive.google.com/file/d/1ZSOdH_hylqyPQ_0Mw5SfJDFroob7JKct/view"
    },
    {
      "company": "Future Ready Talent 🌐",
      "role": "Azure Cloud Virtual Intern",
      "period": "Jul 2021 - Nov 2021",
      "details": [
        "Spearheaded the project under the TCS-Microsoft SIRIUS initiative, focusing on MS Azure and Power Platform training.",
        "Deployed the Institute Management Portal using Azure App Services, ensuring scalability and availability.",
        "Integrated Azure CosmosDB for student and faculty data management, improving data handling for large-scale datasets."
      ],
      "certificateLink": "https://drive.google.com/file/d/1lRxrKSH9eOEC-s-tBNP8qNhqH5VE6cK0/view"
    },
    {
      "company": "CHARUSAT University 🏭",
      "role": "Full Stack Developer Intern",
      "period": "May 2021 - Jun 2021",
      "details": [
        "Developed an inventory system for Envin Engineering, optimizing parts tracking and automating service billing.",
        "Managed MySQL database design, optimizing CRUD operations and enhancing data decisions with complex queries.",
        "Increased order preparation accuracy by 15% through improved visibility into mechanical parts stock."
      ],
      "certificateLink": "https://drive.google.com/file/d/1Ej3lp81SUVch07Icw5CER24K16UwHV8l/view"
    }
  ]
  