[
    {
      "title": "DalVacationHome 🏠",
      "stack": "ReactJS, NodeJS, AWS, GCP",
      "details": [
        "Architected and deployed a multi-cloud booking app on AWS and Google Cloud, ensuring scalability and 99.9% uptime.",
        "Designed an Amazon Lex Chatbot and AWS Lambda-based booking logic for user interaction and support.",
        "Automated deployment via GitLab CI/CD, and implemented Infrastructure As Code using CloudFormation.",
        "Implemented booking and authentication notifications with AWS SNS and SQS, ensuring real-time updates and security."
      ],
      "githubLink": "https://github.com/JAYDIPSINH27/DalVacationHome"
    },
    {
      "title": "FurrEverHome 🐾",
      "stack": "SpringBoot, ReactJS",
      "details": [
        "Created a CI/CD pipeline with Docker and GitLab runners, reducing build and deployment times by 60% through caching.",
        "Applied Test Driven Development (TDD) using JUnit, achieving 80% code coverage and reducing bugs by 50%.",
        "Followed Agile Methodologies completing user stories, client meetings, on-time delivery, and increasing client satisfaction."
      ],
      "githubLink": "https://github.com/JAYDIPSINH27/FurrEverHome"
    },
    {
      "title": "BidSphere 📑",
      "stack": "MongoDB, AWS, ReactJS, NodeJS, ExpressJS, SpringBoot, Microservices, Stripe",
      "details": [
        "Architected a scalable microservices backend with Node.js and Spring Boot, enhancing performance and team collaboration.",
        "Developed a document and tender management module using Spring Boot and AWS S3 for storing 5 document types.",
        "Integrated Stripe payment gateway and APIs into Node.js microservices for scalable and secure transaction processing.",
        "Developed landing page with Framer Motion's AnimatePresence, optimizing DOM manipulation for faster load times.",
        "Applied Atomic Design in ReactJS to build over 20 reusable UI components, reducing development time for new features."
      ],
      "githubLink": "https://github.com/JAYDIPSINH27/BidSphere"
    } 
  ]
  